#!/bin/bash
#Рязанцев ЕА. Версия ...
#Скрипт создает виртуальную машину в интрактивном режиме.
#
# Вывести информацию о предустановленных вирт. машинах и их количестве.
#alias vm='bash vm.sh'
# И повесить на кнопку F12 например

#=====================================

#Функция1
# $1-команда  
fun1()
{
#	if [[ "$1" != [xX] ]] ; then
namelistVM=""
read -p "Укажи № номера ВМ или [eXit]:" listnameVM
	
[[ $listnameVM =~ [Xx] ]] && continue
	for numVB in $listnameVM # Номер в имя машины
        do 
	if [[ $numVB =~ ^[0-9]+$ ]] ; then
namelistVM+=" $(prlctl list -a | awk 'NR>1 {print S1="VM:\t\t"$5,$3="\t",$2}'| grep -n VM: | grep -w ^$numVB | awk '{print $2}')"

	else
echo "Некорректный указан аргумент ВМ: $numVB"
        fi	
	done #Номер в имя машины

	#Действие со списком ВМ
nameVM=""
	for nameVM in $namelistVM
        do
#echo $numVB
#echo $nameVM
#echo "$1"
echo "$nameVM####################$nameVM#######################$nameVM"
request=""
read -p "Будет $1 ВМ: $nameVM [Y/n]" request && ( [[ $request =~ [Yy] ]] && prlctl $1 $nameVM ) || continue 	
        	
	done #Действие со списком ВМ
#	else
#echo " "
#fi
}

#===========================================================================================
#===========================================================================================
X=0
	until [[ $X == [Xx] ]]
	do

echo "........................................................................."
echo "$(prlctl list -a | awk 'NR>1 {print S1="VM:\t\t"$5,$3="\t",$2}'| grep -n VM: | column -t | pr -t -2 )"
echo "........................................................................."
echo "Создать(c) Редактировать>>(e) Запустить(r) \
Запуст.ВСЕ(R) Рестарт(Z) Остановить(s) Останов.ВСЕ(S) \
Удалить(d) Информация(i) Список(L) Клон.(k) Выход(x)" | tr -s " " "\n" | pr -t -4

# в демо версии, последующая обработка отключана
